{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Archives",
    "1": "Code",
    "2": "Docs",
    "3": "Finance",
    "4": "Logs",
    "5": "Media",
    "6": "Other",
    "7": "Study"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Archives": 0,
    "Code": 1,
    "Docs": 2,
    "Finance": 3,
    "Logs": 4,
    "Media": 5,
    "Other": 6,
    "Study": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.1",
  "vocab_size": 119547
}
